; ModuleID = 'example/path.c'
source_filename = "example/path.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.Vec2d = type { double, double }
%struct.Vector_Vec2d = type { %struct.Vec2d*, %struct.Vec2d*, i32 }
%struct.Vector_LineSegment2d = type { %struct.LineSegment2d*, %struct.LineSegment2d*, i32 }
%struct.LineSegment2d = type { %struct.Vec2d, %struct.Vec2d, %struct.Vec2d, double, double }
%struct.LaneInfo = type { double, %struct.Vector_Vec2d, %struct.Vector_Vec2d, %struct.Vector_LineSegment2d, %struct.Vector_double, %struct.LaneBoundary, %struct.Vector_int }
%struct.Vector_double = type { double*, double*, i32 }
%struct.LaneBoundary = type { double, %struct.Vector_LaneBoundaryType }
%struct.Vector_LaneBoundaryType = type { %struct.LaneBoundaryType*, %struct.LaneBoundaryType*, i32 }
%struct.LaneBoundaryType = type { double, i32*, i32 }
%struct.Vector_int = type { i32*, i32*, i32 }
%struct.LaneWaypoint = type { %struct.LaneInfo*, double, double }

; Function Attrs: nounwind readnone uwtable
define double @min_double(double, double) local_unnamed_addr #0 !dbg !87 {
  tail call void @llvm.dbg.value(metadata double %0, i64 0, metadata !91, metadata !93), !dbg !94
  tail call void @llvm.dbg.value(metadata double %1, i64 0, metadata !92, metadata !93), !dbg !95
  %3 = fcmp olt double %0, %1, !dbg !96
  %4 = select i1 %3, double %0, double %1, !dbg !97
  ret double %4, !dbg !98
}


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 5.0.0-3~16.04.1 (tags/RELEASE_500/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !12)
!1 = !DIFile(filename: "example/path.c", directory: "/home/parallels/llvm_proof")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Type", file: !1, line: 108, size: 32, elements: !4)
!4 = !{!5, !6, !7, !8, !9, !10, !11}
!5 = !DIEnumerator(name: "UNKNOWN", value: 0)
!6 = !DIEnumerator(name: "DOTTED_YELLOW", value: 1)
!7 = !DIEnumerator(name: "DOTTED_WHITE", value: 2)
!8 = !DIEnumerator(name: "SOLID_YELLOW", value: 3)
!9 = !DIEnumerator(name: "SOLID_WHITE", value: 4)
!10 = !DIEnumerator(name: "DOUBLE_YELLOW", value: 5)
!11 = !DIEnumerator(name: "CURB", value: 6)
!12 = !{!13}
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LaneWaypoint", file: !1, line: 235, size: 192, elements: !15)
!15 = !{!16, !81, !82}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "lane_", scope: !14, file: !1, line: 236, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LaneInfo", file: !1, line: 138, size: 1280, elements: !20)
!20 = !{!21, !23, !35, !36, !50, !57, !74}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "total_length_", scope: !19, file: !1, line: 139, baseType: !22, size: 64)
!22 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "points_", scope: !19, file: !1, line: 140, baseType: !24, size: 192, offset: 64)
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Vector_Vec2d", file: !1, line: 64, size: 192, elements: !25)
!25 = !{!26, !32, !33}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !24, file: !1, line: 65, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Vec2d", file: !1, line: 41, size: 128, elements: !29)
!29 = !{!30, !31}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "x_", scope: !28, file: !1, line: 42, baseType: !22, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "y_", scope: !28, file: !1, line: 43, baseType: !22, size: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !24, file: !1, line: 66, baseType: !27, size: 64, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !24, file: !1, line: 67, baseType: !34, size: 32, offset: 128)
!34 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "unit_directions_", scope: !19, file: !1, line: 141, baseType: !24, size: 192, offset: 256)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "segments_", scope: !19, file: !1, line: 142, baseType: !37, size: 192, offset: 448)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Vector_LineSegment2d", file: !1, line: 90, size: 192, elements: !38)
!38 = !{!39, !48, !49}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !37, file: !1, line: 91, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LineSegment2d", file: !1, line: 82, size: 512, elements: !42)
!42 = !{!43, !44, !45, !46, !47}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "start_", scope: !41, file: !1, line: 83, baseType: !28, size: 128)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !41, file: !1, line: 84, baseType: !28, size: 128, offset: 128)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "unit_direction_", scope: !41, file: !1, line: 85, baseType: !28, size: 128, offset: 256)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "heading_", scope: !41, file: !1, line: 86, baseType: !22, size: 64, offset: 384)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "length_", scope: !41, file: !1, line: 87, baseType: !22, size: 64, offset: 448)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !37, file: !1, line: 92, baseType: !40, size: 64, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !37, file: !1, line: 93, baseType: !34, size: 32, offset: 128)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "accumulated_s_", scope: !19, file: !1, line: 143, baseType: !51, size: 192, offset: 640)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Vector_double", file: !1, line: 19, size: 192, elements: !52)
!52 = !{!53, !55, !56}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !51, file: !1, line: 20, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !51, file: !1, line: 21, baseType: !54, size: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !51, file: !1, line: 22, baseType: !34, size: 32, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "right_boundary", scope: !19, file: !1, line: 144, baseType: !58, size: 256, offset: 832)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LaneBoundary", file: !1, line: 130, size: 256, elements: !59)
!59 = !{!60, !61}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !58, file: !1, line: 131, baseType: !22, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "boundary_type", scope: !58, file: !1, line: 132, baseType: !62, size: 192, offset: 64)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Vector_LaneBoundaryType", file: !1, line: 124, size: 192, elements: !63)
!63 = !{!64, !72, !73}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !62, file: !1, line: 125, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LaneBoundaryType", file: !1, line: 118, size: 192, elements: !67)
!67 = !{!68, !69, !71}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !66, file: !1, line: 119, baseType: !22, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !66, file: !1, line: 120, baseType: !70, size: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "types_size", scope: !66, file: !1, line: 121, baseType: !34, size: 32, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !62, file: !1, line: 126, baseType: !65, size: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !62, file: !1, line: 127, baseType: !34, size: 32, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "right_neighbor_forward_lane_id", scope: !19, file: !1, line: 145, baseType: !75, size: 192, offset: 1088)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Vector_int", file: !1, line: 10, size: 192, elements: !76)
!76 = !{!77, !79, !80}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !75, file: !1, line: 11, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !75, file: !1, line: 12, baseType: !78, size: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !75, file: !1, line: 13, baseType: !34, size: 32, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !14, file: !1, line: 237, baseType: !22, size: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !14, file: !1, line: 238, baseType: !22, size: 64, offset: 128)
!83 = !{i32 2, !"Dwarf Version", i32 4}
!84 = !{i32 2, !"Debug Info Version", i32 3}
!85 = !{i32 1, !"wchar_size", i32 4}
!86 = !{!"clang version 5.0.0-3~16.04.1 (tags/RELEASE_500/final)"}
!87 = distinct !DISubprogram(name: "min_double", scope: !1, file: !1, line: 25, type: !88, isLocal: false, isDefinition: true, scopeLine: 25, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !90)
!88 = !DISubroutineType(types: !89)
!89 = !{!22, !22, !22}
!90 = !{!91, !92}
!91 = !DILocalVariable(name: "a", arg: 1, scope: !87, file: !1, line: 25, type: !22)
!92 = !DILocalVariable(name: "b", arg: 2, scope: !87, file: !1, line: 25, type: !22)
!93 = !DIExpression()
!94 = !DILocation(line: 25, column: 26, scope: !87)
!95 = !DILocation(line: 25, column: 36, scope: !87)
!96 = !DILocation(line: 26, column: 12, scope: !87)
!97 = !DILocation(line: 26, column: 10, scope: !87)
!98 = !DILocation(line: 26, column: 3, scope: !87)
!99 = distinct !DISubprogram(name: "lower_bound_double", scope: !1, file: !1, line: 29, type: !100, isLocal: false, isDefinition: true, scopeLine: 29, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !102)
!100 = !DISubroutineType(types: !101)
!101 = !{!54, !54, !54, !22}
!102 = !{!103, !104, !105, !106}
!103 = !DILocalVariable(name: "start", arg: 1, scope: !99, file: !1, line: 29, type: !54)
!104 = !DILocalVariable(name: "end", arg: 2, scope: !99, file: !1, line: 29, type: !54)
!105 = !DILocalVariable(name: "value", arg: 3, scope: !99, file: !1, line: 29, type: !22)
!106 = !DILocalVariable(name: "p", scope: !99, file: !1, line: 31, type: !54)
!107 = !DILocation(line: 29, column: 36, scope: !99)
!108 = !DILocation(line: 29, column: 51, scope: !99)
!109 = !DILocation(line: 29, column: 63, scope: !99)
!110 = !DILocation(line: 30, column: 8, scope: !111)
!111 = distinct !DILexicalBlock(scope: !99, file: !1, line: 30, column: 7)
!112 = !DILocation(line: 30, column: 18, scope: !111)
!113 = !DILocation(line: 30, column: 14, scope: !111)
!114 = !DILocation(line: 31, column: 11, scope: !99)
!115 = !DILocation(line: 32, column: 21, scope: !116)
!116 = distinct !DILexicalBlock(scope: !117, file: !1, line: 32, column: 3)
!117 = distinct !DILexicalBlock(scope: !99, file: !1, line: 32, column: 3)
!118 = !DILocation(line: 32, column: 3, scope: !117)
!119 = !DILocation(line: 33, column: 9, scope: !120)
!120 = distinct !DILexicalBlock(scope: !121, file: !1, line: 33, column: 9)
!121 = distinct !DILexicalBlock(scope: !116, file: !1, line: 32, column: 34)
!122 = !{!123, !123, i64 0}
!123 = !{!"double", !124, i64 0}
!124 = !{!"omnipotent char", !125, i64 0}
!125 = !{!"Simple C/C++ TBAA"}
!126 = !DILocation(line: 33, column: 12, scope: !120)
!127 = !DILocation(line: 33, column: 9, scope: !121)
!128 = !DILocation(line: 32, column: 29, scope: !116)
!129 = distinct !{!129, !118, !130}
!130 = !DILocation(line: 34, column: 3, scope: !117)
!131 = !DILocation(line: 36, column: 1, scope: !99)
!132 = distinct !DISubprogram(name: "InnerProd", scope: !1, file: !1, line: 46, type: !133, isLocal: false, isDefinition: true, scopeLine: 46, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !136)
!133 = !DISubroutineType(types: !134)
!134 = !{!22, !135, !135}
!135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!136 = !{!137, !138}
!137 = !DILocalVariable(name: "point1", arg: 1, scope: !132, file: !1, line: 46, type: !135)
!138 = !DILocalVariable(name: "point2", arg: 2, scope: !132, file: !1, line: 46, type: !135)
!139 = !DIExpression(DW_OP_LLVM_fragment, 0, 64)
!140 = !DILocation(line: 46, column: 37, scope: !132)
!141 = !DIExpression(DW_OP_LLVM_fragment, 64, 64)
!142 = !DILocation(line: 46, column: 64, scope: !132)
!143 = !DILocation(line: 47, column: 20, scope: !132)
!144 = !DILocation(line: 47, column: 44, scope: !132)
!145 = !DILocation(line: 47, column: 32, scope: !132)
