; ModuleID = 'example/demo.c'
source_filename = "example/demo.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.PncMap = type { %struct.RoutingResponse, %struct.VehicleState, %struct.LaneWaypoint, %struct.Vector_WaypointIndex, %struct.Vector_RouteIndex, %struct.Set_String, %struct.Set_String, i32, i32, i32, i32, i8 }
%struct.RoutingResponse = type { %struct.RoutingRequest, %struct.RoadSegment*, i32 }
%struct.RoutingRequest = type { %struct.Vector_LaneWaypoint* }
%struct.Vector_LaneWaypoint = type { %struct.LaneWaypoint*, %struct.LaneWaypoint*, i32 }
%struct.RoadSegment = type { %struct.String, %struct.Passage*, i32 }
%struct.String = type {}
%struct.Passage = type { %struct.LaneSegment*, i32 }
%struct.LaneSegment = type { %struct.String, %struct.Lane* }
%struct.Lane = type {}
%struct.VehicleState = type {}
%struct.LaneWaypoint = type { %struct.String, double }
%struct.Vector_WaypointIndex = type { %struct.WaypointIndex*, %struct.WaypointIndex*, i32 }
%struct.WaypointIndex = type { %struct.LaneWaypoint, i32 }
%struct.Vector_RouteIndex = type { %struct.RouteIndex*, %struct.RouteIndex*, i32 }
%struct.RouteIndex = type { %struct.LaneSegment, %struct.Index }
%struct.Index = type { i32, i32, i32 }
%struct.Set_String = type {}
%struct.Vector_RouteIndex.0 = type opaque
%struct.Vector_RouteIndex.1 = type opaque
%struct.Vector_RouteIndex.2 = type opaque
%struct.Vector_RouteIndex.3 = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 5.0.0-3~16.04.1 (tags/RELEASE_500/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2)
!1 = !DIFile(filename: "example/demo.c", directory: "/home/parallels/llvm_proof")
!2 = !{}
!3 = !{i32 2, !"Dwarf Version", i32 4}
!4 = !{i32 2, !"Debug Info Version", i32 3}
!5 = !{i32 1, !"wchar_size", i32 4}
!6 = !{!"clang version 5.0.0-3~16.04.1 (tags/RELEASE_500/final)"}
!7 = distinct !DISubprogram(name: "UpdateVehicleState", scope: !1, file: !1, line: 117, type: !8, isLocal: false, isDefinition: true, scopeLine: 117, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !96)
!8 = !DISubroutineType(types: !9)
!9 = !{!10, !11, !94}
!10 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PncMap", file: !1, line: 92, size: 832, elements: !13)
!13 = !{!14, !55, !57, !58, !70, !86, !88, !89, !90, !91, !92, !93}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "routing_", scope: !12, file: !1, line: 93, baseType: !15, size: 192)
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RoutingResponse", file: !1, line: 86, size: 192, elements: !16)
!16 = !{!17, !35, !54}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "route_request", scope: !15, file: !1, line: 87, baseType: !18, size: 64)
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RoutingRequest", file: !1, line: 82, size: 64, elements: !19)
!19 = !{!20}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "waypoint", scope: !18, file: !1, line: 83, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Vector_LaneWaypoint", file: !1, line: 26, size: 192, elements: !23)
!23 = !{!24, !32, !33}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !22, file: !1, line: 27, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LaneWaypoint", file: !1, line: 14, size: 64, elements: !27)
!27 = !{!28, !30}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !26, file: !1, line: 15, baseType: !29)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "String", file: !1, line: 4, elements: !2)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !26, file: !1, line: 16, baseType: !31, size: 64)
!31 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !22, file: !1, line: 28, baseType: !25, size: 64, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !22, file: !1, line: 29, baseType: !34, size: 32, offset: 128)
!34 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "road", scope: !15, file: !1, line: 88, baseType: !36, size: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RoadSegment", file: !1, line: 76, size: 128, elements: !38)
!38 = !{!39, !40, !53}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !37, file: !1, line: 77, baseType: !29)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "passage", scope: !37, file: !1, line: 78, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Passage", file: !1, line: 71, size: 128, elements: !43)
!43 = !{!44, !52}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "segment", scope: !42, file: !1, line: 72, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LaneSegment", file: !1, line: 45, size: 64, elements: !47)
!47 = !{!48, !49}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !46, file: !1, line: 46, baseType: !29)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "lane", scope: !46, file: !1, line: 47, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Lane", file: !1, line: 6, elements: !2)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !42, file: !1, line: 73, baseType: !34, size: 32, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !37, file: !1, line: 79, baseType: !34, size: 32, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !15, file: !1, line: 89, baseType: !34, size: 32, offset: 128)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "adc_state_", scope: !12, file: !1, line: 94, baseType: !56, offset: 192)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VehicleState", file: !1, line: 8, elements: !2)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "adc_waypoint_", scope: !12, file: !1, line: 95, baseType: !26, size: 64, offset: 192)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "routing_waypoint_index_", scope: !12, file: !1, line: 96, baseType: !59, size: 192, offset: 256)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Vector_WaypointIndex", file: !1, line: 35, size: 192, elements: !60)
!60 = !{!61, !68, !69}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !59, file: !1, line: 36, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "WaypointIndex", file: !1, line: 21, size: 128, elements: !64)
!64 = !{!65, !66}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "waypoint", scope: !63, file: !1, line: 22, baseType: !26, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !63, file: !1, line: 23, baseType: !67, size: 32, offset: 64)
!67 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !59, file: !1, line: 37, baseType: !62, size: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !59, file: !1, line: 38, baseType: !34, size: 32, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "route_indices_", scope: !12, file: !1, line: 97, baseType: !71, size: 192, offset: 448)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Vector_RouteIndex", file: !1, line: 65, size: 192, elements: !72)
!72 = !{!73, !84, !85}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !71, file: !1, line: 66, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RouteIndex", file: !1, line: 56, size: 192, elements: !76)
!76 = !{!77, !78}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "segment", scope: !75, file: !1, line: 57, baseType: !46, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !75, file: !1, line: 58, baseType: !79, size: 96, offset: 64)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Index", file: !1, line: 50, size: 96, elements: !80)
!80 = !{!81, !82, !83}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "road_index", scope: !79, file: !1, line: 51, baseType: !67, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "passage_index", scope: !79, file: !1, line: 52, baseType: !67, size: 32, offset: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "lane_index", scope: !79, file: !1, line: 53, baseType: !67, size: 32, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !71, file: !1, line: 67, baseType: !74, size: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !71, file: !1, line: 68, baseType: !34, size: 32, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "range_lane_ids_", scope: !12, file: !1, line: 98, baseType: !87, offset: 640)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Set_String", file: !1, line: 10, elements: !2)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "all_lane_ids_", scope: !12, file: !1, line: 99, baseType: !87, offset: 640)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "next_routing_waypoint_index_", scope: !12, file: !1, line: 100, baseType: !34, size: 32, offset: 640)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "adc_route_index_", scope: !12, file: !1, line: 101, baseType: !67, size: 32, offset: 672)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "range_start_", scope: !12, file: !1, line: 102, baseType: !67, size: 32, offset: 704)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "range_end_", scope: !12, file: !1, line: 103, baseType: !67, size: 32, offset: 736)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "stop_for_destination_", scope: !12, file: !1, line: 104, baseType: !10, size: 8, offset: 768)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!96 = !{!97, !98, !99, !100}
!97 = !DILocalVariable(name: "this", arg: 1, scope: !7, file: !1, line: 117, type: !11)
!98 = !DILocalVariable(name: "vehicle_state", arg: 2, scope: !7, file: !1, line: 117, type: !94)
!99 = !DILocalVariable(name: "route_index", scope: !7, file: !1, line: 135, type: !67)
!100 = !DILocalVariable(name: "last_index", scope: !7, file: !1, line: 149, type: !67)
!101 = !DIExpression()
!102 = !DILocation(line: 117, column: 40, scope: !7)
!103 = !DILocation(line: 117, column: 73, scope: !7)
!104 = !DILocation(line: 118, column: 33, scope: !105)
!105 = distinct !DILexicalBlock(scope: !7, file: !1, line: 118, column: 9)
!106 = !DILocation(line: 118, column: 10, scope: !105)
!107 = !DILocation(line: 118, column: 9, scope: !7)
!108 = !DILocation(line: 121, column: 23, scope: !109)
!109 = distinct !DILexicalBlock(scope: !7, file: !1, line: 121, column: 9)
!110 = !DILocation(line: 121, column: 10, scope: !109)
!111 = !DILocation(line: 121, column: 35, scope: !109)
!112 = !DILocation(line: 122, column: 9, scope: !109)
!113 = !DILocation(line: 123, column: 9, scope: !109)
!114 = !{!115, !115, i64 0}
!115 = !{!"int", !116, i64 0}
!116 = !{!"omnipotent char", !117, i64 0}
!117 = !{!"Simple C/C++ TBAA"}
!118 = !DILocation(line: 124, column: 9, scope: !109)
!119 = !DILocation(line: 123, column: 49, scope: !109)
!120 = !DILocation(line: 122, column: 54, scope: !109)
!121 = !DILocation(line: 121, column: 9, scope: !7)
!122 = !DILocation(line: 126, column: 15, scope: !123)
!123 = distinct !DILexicalBlock(scope: !109, file: !1, line: 124, column: 55)
!124 = !DILocation(line: 126, column: 44, scope: !123)
!125 = !{!126, !115, i64 80}
!126 = !{!"PncMap", !127, i64 0, !130, i64 24, !131, i64 24, !134, i64 32, !135, i64 56, !136, i64 80, !136, i64 80, !115, i64 80, !115, i64 84, !115, i64 88, !115, i64 92, !116, i64 96}
!127 = !{!"RoutingResponse", !128, i64 0, !129, i64 8, !115, i64 16}
!128 = !{!"RoutingRequest", !129, i64 0}
!129 = !{!"any pointer", !116, i64 0}
!130 = !{!"VehicleState"}
!131 = !{!"LaneWaypoint", !132, i64 0, !133, i64 0}
!132 = !{!"String"}
!133 = !{!"double", !116, i64 0}
!134 = !{!"Vector_WaypointIndex", !129, i64 0, !129, i64 8, !115, i64 16}
!135 = !{!"Vector_RouteIndex", !129, i64 0, !129, i64 8, !115, i64 16}
!136 = !{!"Set_String"}
!137 = !DILocation(line: 127, column: 15, scope: !123)
!138 = !DILocation(line: 127, column: 32, scope: !123)
!139 = !{!126, !115, i64 84}
!140 = !DILocation(line: 128, column: 15, scope: !123)
!141 = !DILocation(line: 128, column: 37, scope: !123)
!142 = !{!126, !116, i64 96}
!143 = !DILocation(line: 129, column: 5, scope: !123)
!144 = !DILocation(line: 132, column: 59, scope: !145)
!145 = distinct !DILexicalBlock(scope: !7, file: !1, line: 132, column: 9)
!146 = !DILocation(line: 132, column: 10, scope: !145)
!147 = !DILocation(line: 132, column: 9, scope: !7)
!148 = !DILocation(line: 135, column: 23, scope: !7)
!149 = !DILocation(line: 135, column: 9, scope: !7)
!150 = !DILocation(line: 136, column: 21, scope: !151)
!151 = distinct !DILexicalBlock(scope: !7, file: !1, line: 136, column: 9)
!152 = !DILocation(line: 136, column: 25, scope: !151)
!153 = !DILocation(line: 137, column: 47, scope: !151)
!154 = !DILocation(line: 137, column: 40, scope: !151)
!155 = !DILocation(line: 137, column: 24, scope: !151)
!156 = !DILocation(line: 137, column: 21, scope: !151)
!157 = !DILocation(line: 136, column: 9, scope: !7)
!158 = !DILocation(line: 142, column: 5, scope: !7)
!159 = !DILocation(line: 143, column: 11, scope: !7)
!160 = !DILocation(line: 143, column: 28, scope: !7)
!161 = !DILocation(line: 144, column: 5, scope: !7)
!162 = !DILocation(line: 145, column: 36, scope: !163)
